-- phpMyAdmin SQL Dump
-- version 4.4.14
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- 생성 시간: 15-10-02 07:07
-- 서버 버전: 5.6.26
-- PHP 버전: 5.6.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `knutimetable`
--

-- --------------------------------------------------------

--
-- 테이블 구조 `knu_college_list`
--

CREATE TABLE IF NOT EXISTS `knu_college_list` (
  `num` int(11) NOT NULL,
  `depart` varchar(20) DEFAULT NULL,
  `major` varchar(20) DEFAULT NULL
) ENGINE=InnoDB AUTO_INCREMENT=134 DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `knu_college_list`
--

INSERT INTO `knu_college_list` (`num`, `depart`, `major`) VALUES
(1, '가정교육과', '가정교육과'),
(2, '간호학과', '간호학과'),
(3, '경영.회계학부', '경영.회계학부'),
(4, '경영.회계학부', '경영학전공'),
(5, '경영.회계학부', '회계학전공'),
(6, '경제.무역학부', '경제.무역학부'),
(7, '경제.무역학부', '경제학전공'),
(8, '경제.무역학부', '국제무역학전공'),
(9, '과학교육학부', '과학교육학부'),
(10, '과학교육학부', '물리교육전공'),
(11, '과학교육학부', '생물교육전공'),
(12, '과학교육학부', '지구과학교육전공'),
(13, '과학교육학부', '화학교육전공'),
(14, '관광경영학과', '관광경영학과'),
(15, '교육학과', '교육학과'),
(16, '국어교육과', '국어교육과'),
(17, '국어국문학과', '국어국문학과'),
(18, '글로벌비즈니스학과', '글로벌비즈니스학과'),
(19, '기계의용공학과', '기계의용공학과'),
(20, '나노응용공학과', '나노응용공학과'),
(21, '농생명산업학과', '농생명산업학과'),
(22, '농업생명과학대학', '농업생명과학대학'),
(23, '농업자원경제학과', '농업자원경제학과'),
(24, '도시건축학부', '건축공학전공'),
(25, '도시건축학부', '건축학전공(5년제)'),
(26, '독어독문학과', '독어독문학과'),
(27, '동물생명과학대학', '동물생명과학대학'),
(28, '동물응용과학부', '동물생명공학전공'),
(29, '동물응용과학부', '동물응용과학부'),
(30, '동물응용과학부', '축산식품과학전공'),
(31, '동물자원과학부', '동물자원과학부'),
(32, '동물자원과학부', '사료생산과학전공'),
(33, '동물자원과학부', '축산과학전공'),
(34, '디자인학과', '디자인학과'),
(35, '디자인학과', '비주얼디자인전공'),
(36, '디자인학과', '영상디자인전공'),
(37, '디자인학과', '인더스트리얼디자인전공'),
(38, '메카트로닉스공학과', '메카트로닉스공학과'),
(39, '무용학과', '무용학과'),
(40, '무용학과', '발레전공'),
(41, '무용학과', '한국무용전공'),
(42, '무용학과', '현대무용전공'),
(43, '문화예술대학', '문화예술대학'),
(44, '문화인류학과', '문화인류학과'),
(45, '물리학과', '물리학과'),
(46, '미술학과', '공예전공'),
(47, '미술학과', '미술학과'),
(48, '미술학과', '서양화전공'),
(49, '미술학과', '조소전공'),
(50, '미술학과', '한국화전공'),
(51, '바이오시스템공학과', '바이오시스템공학과'),
(52, '바이오자원환경학과', '바이오자원환경학과'),
(53, '법학부', '법학부'),
(54, '부동산학과', '부동산학과'),
(55, '분자생명과학과', '분자생명과학과'),
(56, '불어불문학과', '불어불문학과'),
(57, '사범대학', '사범대학'),
(58, '사학과', '사학과'),
(59, '사회과학대학', '사회과학대학'),
(60, '사회학과', '사회학과'),
(61, '산림과학부', '산림경영학전공'),
(62, '산림과학부', '산림과학부'),
(63, '산림과학부', '산림자원학전공'),
(64, '산림과학부', '산림환경보호학전공'),
(65, '산림응용공학부', '산림바이오소재공학전공'),
(66, '산림응용공학부', '산림응용공학부'),
(67, '산림응용공학부', '제지공학전공'),
(68, '산림환경과학대학', '산림환경과학대학'),
(69, '생명건강공학과', '생명건강공학과'),
(70, '생명과학과', '생명과학과'),
(71, '생물공학과', '생물공학과'),
(72, '생물의소재공학과', '생물의소재공학과'),
(73, '생물자원과학부', '생물자원과학부'),
(74, '생물자원과학부', '식물자원응용과학전공'),
(75, '생물자원과학부', '응용생물학전공'),
(76, '생화학과', '생화학과'),
(77, '수의예과', '수의예과'),
(78, '수의학과', '수의학과'),
(79, '수학과', '수학과'),
(80, '수학교육과', '수학교육과'),
(81, '스토리텔링학과', '스토리텔링학과'),
(82, '스포츠과학부', '스포츠과학부'),
(83, '스포츠과학부', '스포츠과학전공'),
(84, '스포츠과학부', '스포츠지도전공'),
(85, '시설농업학과', '시설농업학과'),
(86, '시스템경영공학과', '시스템경영공학과'),
(87, '시스템면역과학과', '시스템면역과학과'),
(88, '식품생명공학과', '식품생명공학과'),
(89, '신문방송학과', '신문방송학과'),
(90, '심리학과', '심리학과'),
(91, '약학과', '약학과'),
(92, '역사교육과', '역사교육과'),
(93, '영상문화학과', '영상문화학과'),
(94, '영어교육과', '영어교육과'),
(95, '영어영문학과', '영어영문학과'),
(96, '원예학과', '원예학과'),
(97, '윤리교육과', '윤리교육과'),
(98, '음악학과', '관현악전공'),
(99, '음악학과', '성악전공'),
(100, '음악학과', '음악학과'),
(101, '음악학과', '작곡전공'),
(102, '음악학과', '피아노전공'),
(103, '의생명공학과', '의생명공학과'),
(104, '의생명과학대학', '의생명과학대학'),
(105, '인문대학', '인문대학'),
(106, '일반사회교육과', '일반사회교육과'),
(107, '일본학과', '일본학과'),
(108, '자연과학대학', '자연과학대학'),
(109, '자원공학과', '자원공학과'),
(110, '전기전자공학부', '전기전자공학부'),
(111, '전기전자공학부', '전기전자공학전공'),
(112, '전기전자공학부', '전자공학전공'),
(113, '전기전자공학부', '전자통신공학전공'),
(114, '정보통계학과', '정보통계학과'),
(115, '정치외교학과', '정치외교학과'),
(116, '조경학과', '조경학과'),
(117, '중어중문학과', '중어중문학과'),
(118, '지리교육과', '지리교육과'),
(119, '지역건설공학과', '지역건설공학과'),
(120, '지질.지구물리학부', '지구물리학전공'),
(121, '지질.지구물리학부', '지질.지구물리학부'),
(122, '지질.지구물리학부', '지질학전공'),
(123, '철학과', '철학과'),
(124, '컴퓨터학부', '컴퓨터과학전공'),
(125, '컴퓨터학부', '컴퓨터정보통신공학전공'),
(126, '컴퓨터학부', '컴퓨터학부'),
(127, '토목공학과', '토목공학과'),
(128, '한문교육과', '한문교육과'),
(129, '행정학과', '행정학과'),
(130, '화학공학과', '화학공학과'),
(131, '화학과', '화학과'),
(132, '환경공학과', '환경공학과'),
(133, '환경학과', '환경학과');

--
-- 덤프된 테이블의 인덱스
--

--
-- 테이블의 인덱스 `knu_college_list`
--
ALTER TABLE `knu_college_list`
  ADD PRIMARY KEY (`num`);

--
-- 덤프된 테이블의 AUTO_INCREMENT
--

--
-- 테이블의 AUTO_INCREMENT `knu_college_list`
--
ALTER TABLE `knu_college_list`
  MODIFY `num` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=134;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
